{
  "body": "In the era of home automation and Internet of Things, we are surrounded by all kind of electronic devices for our home, car or even clothes. They should make our lives easier because they are smart but what does it really mean? Read this article to find out and to learn the basics!\n\nA smart device is an electronic device connected to other devices or network via some kind of networking technology, usually wireless, like Wi-Fi, Bluetooth, NFC, Z-Wave or Zigbee.\n\nSmart devices can be divided into sensors, actors and controllers.\n\n**Sensors** are all devices which provide some kind of data or measurements, for example motion sensors, temperature sensors or even an electric car reporting its battery level.\n\n**Actors** perform any kind of actions, most of the time those actions are triggered by data provided by sensors. For example when a motion is detected in a room by motion sensor, it can trigger smart switch to switch on the light or play music from our favourite radio station.\n\nWith the increased complexity of most recent smart devices, many of them are sensors and actors at the same time. For example smart thermostat is a sensor because it measures temperature in the room. It is also an actor because it adjusts heating and air conditioning using its own temperature measurements to achieve the temperature conditions we want in the room.\n\n**Controllers** are special devices which are not necessary for many setups. However, controllers bring the true „smartness” to our smart homes.\nLet say that one motion sensor’s battery has discharged completely and it is not operating at all. It is not able to notify us about its failure because it is powered off. The only way we can notice its issue is when the action it should trigger does not execute. It is not a serious issue if only the light in the room just do not switch on but it is a critical issue if our motion sensor should also trigger an alarm when we are on vacations.\nHere comes a controller with its **diagnostics** role. It can monitor state of our smart devices and is able to notify us if some devices do not respond or behave in an incorrect way.\nAnother main feature of the controller is to control complex **scenes**. For example we can create a *Movie* scene with dimmed lights and AVR audio output configured for the best movie oriented experience. With a compatible smart TV, this scene could be even launched automatically because our TV can notify the controller that the movie is now playing and the controller will setup everything for us automatically. So if we are on the home theatre topic, let’s say a few words about…\n\n**Smart speakers** with direct access to the streaming services, playing the same, perfectly synchronized music in different rooms with completely wireless multi-room technology. Sometimes with a voice assistant built in. Controlled via mobile applications. Very convenient in daily use, versatile and able to play music from smartphones.\nOf course we also have **smart TVs** with direct access to YouTube, Netflix, recording features and embedded digital decoders like DVB-C and DVB-S. Controlled with old-fashioned remote or with another app. If one also has AVR device connected to TV, it usually requires additional remote and one more app.\n\nWith Intellimote app it is no longer needed to switch applications in order to control different devices, we only need to select device with a simple swipe gesture and that’s it. One app for  various devices, available also on the Watch."
}