{
  "body": "Before the era of smart homes and the Internet of Things, most speakers were connected to a music source with some kind of wires. A concept of playing sound from different sources in different rooms, with an ability to control each room independently was a science fiction for most users. It was possible, but such setup was very expensive and had to be literally built into the house because it requires a lot of wires and a sophisticated control unit which was placed in a basement. After a major home renovation and thousands of dollars later, we could put our favourite CD to a Hi-Fi in the living room and listen to the music, for example, in the guest bedroom on the third floor. This was a case for many years but with an introduction of the home theatre systems, modern Audio Video Receivers were capable to deliver sound to another room in an affordable and pretty straightforward way. That was possible with a *multi-zone* feature.\n\n**Multi-zone capabilities of AVR devices**\\\nModern AVRs have a lot of outputs in order to support surround audio formats. Surround system requires at least six speakers (for 5.1 setup) but many AVRs supports 7.1 and even more complex setups. Because standard 5.1 format is satisfying for most use cases, especially in smaller rooms, and if we have an AVR supporting 7.1+ setup, we end up with unused outputs. If our receiver is a multi-zoned one, we bring two speakers to another room, place the required wires and connect the speakers with spare outputs of our AVR. With this setup we can do following:\n\n* Watch a movie with a 5.1 surround sound and listen to a different music source (for example tuner) in the other room\n* Listen to the same source in both rooms (zones are bridged)\n* Listen to the music only in the other room while Main Zone is powered off in this case\n\\\nUnfortunately things are getting a bit complicated if we want to stream sound from an online source. Usually receivers allow streaming only to the Main Zone. This means that we can listen to online source on Zone B **only** when the Main Zone is using the same source (both zones are bridged) and we cannot use that source on the Zone B when the Main Zone is powered off or uses other input. However not every AVR operates this way and some manufacturers offer models with multiple independent, fully featured and networking enabled zones. This is the most desirable behaviour if we plan to take a step further and use the wireless *multi-room* features of our home audio ecosystem.\n\n**Wireless multi-room sound**\\\nTechnologies like HEOS® or MusicCast® allow us to take advantage of a wireless multi-room features. The concept is very simple, we can join few speakers into a group where one device acts as a server and streams its selected input to clients. The result is a perfectly synchronised sound played by all devices in our group, with ability to control volume and mute on each member independently and all of this happen via our home WiFi network. There are also AVRs compatible with multi-room technology and they can also be servers or clients grouped with other speakers. However there is one catch. If the AVR does not expose two (or more) full featured zones, only the Main Zone can join the multi-room playground and it can eventually pass the sound to the Zone B by bridging it with itself. Only few receivers allow the Zone B to be a multi-room group member without using the Main Zone as some kind of a bridge. Sounds familiar? This is strictly related with *multi-zone* limits when streaming music from online services or using other network sources in general described in the previous paragraph.\n\nIt is worth remembering that *wireless multi-room* and *multi-zone* features are not the same and controlling them requires completely different pieces of technology. With Intellimote we can manage multi-room groups, control group playback, manage volume or mute for both whole group and individual members. When on the player details screen, swipe to present the multi-room manager and create, destroy and manage your group easily."
}